Repository: hanxu11580/UnityUtils
Catalog: Assets/USDT/Editor/XcodeLocalization/Localization/*.lproj/InfoPlist.strings
Languages: de, es_419, fr, it, ja, ko, pt_pt, ru, tr, zh_hans, zh_hant

# NSCalendarsUsageDescription
source: Our app needs access to Calendar to view date.
de: Unsere App benötigt Zugriff auf den Kalender, um das Datum anzuzeigen.
es_419: Nuestra aplicación necesita acceso al calendario para ver la fecha.
fr: Notre application doit accéder au Calendrier pour afficher la date.
it: La nostra app deve accedere al calendario per visualizzare la data.
ja: カレンダーへのアクセス権限を許可しますか？
ko: 게임 이 달력 에 접근 할 수 있 도록 해 주세요.
pt_pt: A nossa app precisa de acesso ao Calendário para ver a data.
ru: Нашему приложению нужен доступ к календарю для просмотра даты.
tr: Tarihi görebilmek için uygulamamızın Takvime erişmesi gerekiyor.
zh_hans: 请允许游戏访问日历
zh_hant: 請允許遊戲訪問日歷

# NSCameraUsageDescription
source: Our app needs access to camera to take photos.
de: Unsere App benötigt Zugriff auf die Kamera, um Fotos aufzunehmen.
es_419: Nuestra aplicación necesita acceso a la cámara para tomar fotos.
fr: Notre application doit accéder à l’appareil photo pour prendre des photos.
it: La nostra app deve accedere alla fotocamera per scattare foto.
ja: カメラへのアクセス権限を許可しますか？
ko: 게임 으로 카메라 에 접근 할 수 있 도록 해 주세요.
pt_pt: A nossa app precisa de acesso à câmara para tirar fotos.
ru: Нашему приложению нужен доступ к камере для фотографирования.
tr: Fotoğraf çekmek için uygulamamızın kameraya erişmesi gerekiyor.
zh_hans: 请允许游戏访问相机
zh_hant: 請允許遊戲訪問相機

# NSContactsUsageDescription
source: Our app needs access to contacts to help you connect with friends in game.
de: Unsere App benötigt Zugriff auf Kontakte, damit du dich mit Freunden im Spiel verbinden kannst.
es_419: Nuestra aplicación necesita acceso a los contactos para ayudar a conectarte con tus amigos en el juego.
fr: Notre application doit accéder aux contacts pour vous aider à vous connecter à vos amis en jeu.
it: La nostra app deve accedere ai contatti per aiutarti a connetterti con gli amici nel gioco.
ja: 電話帳へのアクセス権限を許可しますか？
ko: 게임 방문 주소록 을 허락 해 주 십시오.
pt_pt: A nossa app precisa de acesso aos contactos para ajudar a criar uma ligação com os seus amigos no jogo.
ru: Нашему приложению нужен доступ к контактам, чтобы помочь вам общаться с друзьями в игре.
tr: Oyunda arkadaşlarınla bağlantı kurmana yardımcı olmak için uygulamamızın kişilere erişmesi gerekiyor.
zh_hans: 请允许游戏访问通讯录
zh_hant: 請允許遊戲訪問通訊錄

# NSLocationAlwaysUsageDescription
source: Our app needs access to your location to provide localized content.
de: Unsere App benötigt Zugriff auf deinen Standort, um lokalisierte Inhalte bereitzustellen.
es_419: Nuestra aplicación necesita acceso a tu ubicación para brindar contenido localizado.
fr: Notre application doit accéder à votre emplacement pour fournir du contenu localisé.
it: La nostra app deve accedere alla tua posizione per fornire contenuti localizzati.
ja: カメラへのアクセス権限を許可しますか？
ko: 게임 이 포 지 셔 닝 기능 에 접근 할 수 있 도록 해 주세요.
pt_pt: A nossa app precisa de acesso à sua localização para fornecer conteúdo traduzido.
ru: Нашему приложению нужен доступ к вашему местонахождению, чтобы предлагать вам локализованный контент.
tr: Yerelleştirilmiş içerik sağlamak için uygulamamızın, konumuna erişmesi gerekiyor.
zh_hans: 请允许游戏访问定位功能
zh_hant: 請允許遊戲訪問定位功能

# NSLocationWhenInUseUsageDescription
source: Our app needs access to your location to provide localized content.
de: Unsere App benötigt Zugriff auf deinen Standort, um lokalisierte Inhalte bereitzustellen.
es_419: Nuestra aplicación necesita acceso a tu ubicación para brindar contenido localizado.
fr: Notre application doit accéder à votre emplacement pour fournir du contenu localisé.
it: La nostra app deve accedere alla tua posizione per fornire contenuti localizzati.
ja: 位置情報へのアクセス権限を許可しますか？
ko: 게임 위치 기능 에 접근 할 수 있 도록 해 주세요.
pt_pt: A nossa app precisa de acesso à sua localização para fornecer conteúdo traduzido.
ru: Нашему приложению нужен доступ к вашему местонахождению, чтобы предлагать вам локализованный контент.
tr: Yerelleştirilmiş içerik sağlamak için uygulamamızın, konumuna erişmesi gerekiyor.
zh_hans: 请允许游戏访问位置功能
zh_hant: 請允許遊戲訪問位置功能

# NSMicrophoneUsageDescription
source: Our app needs access to Microphone to enable voice chat.
de: Unsere App benötigt Zugriff auf das Mikrofon, um den Sprachchat nutzen zu können.
es_419: Nuestra aplicación necesita acceso al micrófono para activar el chat de voz.
fr: Notre application doit accéder au micro pour activer le chat vocal.
it: La nostra app deve accedere al microfono per abilitare la chat vocale.
ja: マイクへのアクセス権限を許可しますか？
ko: 게임 마이크 에 접근 할 수 있 게 해 주세요.
pt_pt: A nossa app precisa de acesso ao microfone para ativar o chat de voz.
ru: Нашему приложению нужен доступ к микрофону для активизации голосового чата.
tr: Sesli sohbeti etkinleştirmek için uygulamamızın Mikrofona erişmesi gerekiyor.
zh_hans: 请允许游戏访问麦克风
zh_hant: 請允許遊戲訪問麥克風

# NSPhotoLibraryAddUsageDescription
source: Our app needs access to Photo Album to upload selected photos to our CS.
de: Unsere App benötigt Zugriff auf das Fotoalbum, um ausgewählte Fotos an unseren Kundendienst hochzuladen.
es_419: Nuestra aplicación necesita acceso al álbum de fotos para subir fotos seleccionadas a nuestro Soporte al cliente.
fr: Notre application doit accéder à l’album photos pour transférer les photos sélectionnées sur notre SC.
it: La nostra app deve accedere alla galleria fotografica per caricare le foto selezionate sul nostro CS.
ja: フォトギャラリーの作成を許可しますか？
ko: 앨범 추가 게임 허용 해 주세요.
pt_pt: A nossa app precisa de acesso ao Álbum de Fotos para carregar as fotos selecionadas para o nosso serviço de apoio a clientes.
ru: Нашему приложению нужен доступ к галерее изображения для отправки выбранных фотографий нашей службе поддержки.
tr: Seçilen fotoğrafları Müşteri Hizmetlerimize yüklemek için uygulamamızın, Fotoğraf Albümüne erişmesi gerekiyor.
zh_hans: 请允许游戏添加相册
zh_hant: 請允許遊戲添加相冊

# NSPhotoLibraryUsageDescription
source: Our app needs access to Photo Album to upload selected photos to our CS.
de: Unsere App benötigt Zugriff auf das Fotoalbum, um ausgewählte Fotos an unseren Kundendienst hochzuladen.
es_419: Nuestra aplicación necesita acceso al álbum de fotos para subir fotos seleccionadas a nuestro Soporte al cliente.
fr: Notre application doit accéder à l’album photos pour transférer les photos sélectionnées sur notre SC.
it: La nostra app deve accedere alla galleria fotografica per caricare le foto selezionate sul nostro CS.
ja: フォトギャラリーへのアクセス権限を許可しますか？
ko: 앨범 에 게임 방문 을 허락 해 주 십시오.
pt_pt: A nossa app precisa de acesso ao Álbum de Fotos para carregar as fotos selecionadas para o nosso serviço de apoio a clientes.
ru: Нашему приложению нужен доступ к галерее изображения для отправки выбранных фотографий нашей службе поддержки.
tr: Seçilen fotoğrafları Müşteri Hizmetlerimize yüklemek için uygulamamızın, Fotoğraf Albümüne erişmesi gerekiyor.
zh_hans: 请允许游戏访问相册
zh_hant: 請允許遊戲訪問相冊

# NSBluetoothPeripheralUsageDescription
source: Our app needs access to Bluetooth to connect devices.
de: Unsere App benötigt Zugriff auf Bluetooth, um Geräte zu verbinden.
es_419: Nuestra aplicación necesita acceso a Bluetooth para vincular dispositivos.
fr: Notre application doit accéder au Bluetooth pour connecter des appareils.
it: La nostra app deve accede al Bluetooth per connettere i dispositivi.
ja: ブルートゥースへのアクセス権限を許可しますか？
ko: 게임 블 루 투 스 방문 을 허용 하 세 요
pt_pt: A nossa app precisa de acesso ao Bluetooth para ligar dispositivos.
ru: Нашему приложению нужен доступ к Bluetooth для подключения устройств.
tr: Cihazları bağlamak için uygulamamızın Bluetooth'a erişmesi gerekiyor.
zh_hans: 请允许游戏访问蓝牙
zh_hant: 請允許遊戲訪問藍牙

# NSSpeechRecognitionUsageDescription
source: Our app needs access to Speech Recognition to convert spoken language to text.
de: Unsere App benötigt Zugang zur Spracherkennung, um Gesprochenes in Text umzuwandeln.
es_419: Nuestra aplicación necesita acceso al reconocimiento de voz para convertir lenguaje hablado en texto.
fr: Notre application doit accéder à la reconnaissance vocale pour convertir le langage parlé en texte.
it: La nostra app deve accedere al riconoscimento vocale per convertire la lingua parlata in testo.
ja: 音声認識機能へのアクセス権限を許可しますか？
ko: 게임 으로 음성 인식 기능 에 접근 할 수 있 도록 해 주세요.
pt_pt: A nossa app precisa de acesso ao Reconhecimento de Voz para converter idiomas falados em texto.
ru: Нашему приложению нужен доступ к функции распознавания речи для преобразования произносимых слов в текст.
tr: Konuşmayı metne dönüştürmek için uygulamamızın Konuşma Tanımaya erişmesi gerekiyor.
zh_hans: 请允许游戏访问语音识别功能
zh_hant: 請允許遊戲訪問語音識別功能

# NSUserTrackingUsageDescription
source: You may authorize us to use the ad identification code to avoid random ads. This will help you get a better personalized advertising experience on your device.
de: Du kannst uns erlauben, den Identifikationscode für Werbung zu verwenden, um zufällige Werbung zu vermeiden. Dadurch kann ein besser personalisiertes Werbeerlebnis auf deinem Gerät gewährleistet werden.
es_419: Puede autorizarnos a usar el código de identificación de anuncios para evitar anuncios aleatorios. Esto te ayudará a obtener una mejor experiencia de anuncios personalizada en tu dispositivo.
fr: Vous pouvez nous autoriser à utiliser le code d’identification des publicités pour éviter les publicités aléatoires. Cela vous aidera à recevoir des publicités mieux ciblées sur votre appareil.
it: Puoi autorizzarci a utilizzare il codice di identificazione dell'annuncio per evitare annunci casuali. Questo ti offrir√† un'esperienza pubblicitaria personalizzata sul tuo dispositivo.
ja: 広告からのストレスを軽減するために、広告識別コードの使用権限をお選びいただけます。これによりデバイスでよりパーソナライズされた広告体験が可能になります。
ko: 무작위 광고에 방해받지 않도록 광고 식별 코드 접근을 허용해 주십시오. 기기에서 더 나은 맞춤형 광고를 체험할 수 있습니다.
pt_pt: Pode autorizar-nos a utilizar o código de identificação do anúncio para evitar anúncios aleatórios. Isto ajuda a ter uma melhor experiência de publicidade personalizada no seu dispositivo.
ru: Вы можете разрешить нам использовать код идентификации рекламы, чтобы избежать случайных рекламных роликов. Это поможет вам лучше персонализировать рекламу на вашем устройстве.
tr: Rastgele reklamlardan kaçınmak için reklam tanımlama kodunu kullanmamıza izin verebilirsin. Bu, cihazında daha iyi bir kişiselleştirilmiş reklam deneyimi elde etmene yardımcı olur.
zh_hans: 为了避免您受随机广告的打扰，您可以为我们授权使用广告识别码，这将帮助您在设备上获得更好的个性化广告体验
zh_hant: 為了避免您受隨機廣告的打擾，您可以授權我們使用廣告識別碼，這將幫助您在設備上獲得量身打造的廣告體驗
